# Control work #
Данный проект создан для сдачи Итоговой контрольной работы по курсу "Разработчик.Основной блок"
### Условие задачи ###
-----
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, 
длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры,
либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями,
лучше обойтись исключительно массивами.
### Примеры ###
-----
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]

[“1234”, “1567”, “-2”, “computer science”] → [“-2”]

[“Russia”, “Denmark”, “Kazan”] → []

### Описание решения задачи ###
-----
Согласно условию задачи на старте выполнения алгоритма задаю первоначальный массив:

```c#
string[] array = {"-2", "523", "blue", "sky", "-12"};
```
Далее определяю количество элементов массива, длина которых <=3, с помощью счетчика ``` count ``` :
```c#
for(int i = 0; i < array.Length; i++) {
    if (array[i].Length <= 3) {
        count++;
    }
}
```
Создаю новый массив длины ``` count ``` :
```c#
string[] newArray = new string[count];
```
В него записываю элементы массива, длина которых <=3 :
```c#
for(int i = 0; i < array.Length; i++) {
    if (array[i].Length <= 3) {
        newArray[num] = array[i];
        num++;
    }
}
```
Вывожу на экран результат:
```c#
Console.Write('[' + string.Join(", ", newArray) + ']');
```